'''

问题描述：给定形如下 的矩阵， 
    1 1 1 1 1 1 
     1 1 0 0 0 1 
     1 0 0 0 1 0 
     1 1 0 1 1 1 
     0 1 0 1 0 0 
     1 1 1 1 1 1 
上面矩阵的中的1代表海岸线，0代表小岛。

求第二岛的面积(即被1中包围的0的个数，如果只有一个小岛，输出最大岛的面积)。 

#----------------------------#



'''

import time

island = [  [1, 1, 1, 1, 1, 1],
            [1, 1, 0, 0, 0, 1],
            [1, 0, 0, 0, 1, 0],
            [1, 1, 0, 1, 1, 1],
            [0, 1, 0, 1, 0, 0],
            [1, 1, 1, 1, 1, 1]
        ]

def main_process():
    print('results')

if __name__ == "__main__":
    tic = time.process_time()
    
    main_process()

    toc = time.process_time()
    print("time=",  toc - tic)





